[
  {
    "title": "2024 Ford Ranger Raptor: FINALLY, America Gets the Blue Oval's Beastliest Midsize Truck",
    "imgUrl": "https://www.motortrend.com/uploads/2023/05/2024-Ford-Ranger-Raptor-reveal-60.jpg?fit=around%7C770:481.25",
    "url": "https://www.motortrend.com/news/2024-ford-ranger-raptor-first-look-review/",
    "description": "Enthusiasts can be forgiven for having never paid the Ford Ranger much attention. From 1983 to 2011 it soldiered on with minimal updating and no performance variants (sadly, the company passed on the prototype Cobra-powered SVT Ranger V-8 we tested in the mid-1990s). And when Ford brought the global T6 Ranger here in 2019 (halfway through its life cycle globally), it resumed its predecessors faithful-farm-dog persona. Well, the 2024 Ford Ranger Raptor is your wake-up call to start paying Ford's mid-sizer some attention.",
    "date": "10/05/2023"
  },
  {
    "title": "2024 Ford Ranger First Look: Way More America, Truck Yeah! Than Before",
    "imgUrl": "https://www.motortrend.com/uploads/2023/05/2024-Ford-Ranger-Lariat-reveal-36.jpg?fit=around%7C770:481.25",
    "url": "https://www.motortrend.com/news/2024-ford-ranger-first-look-review/",
    "description": "Ford says the Ranger is the F-150 of the world, a boast that both ties the midsize pickup to the larger, bestselling F-150 and to its global roots of late. It also puts a positive spin on the previous-generation model, which was sent here a few years after it went on sale in the rest of the world, making it both an awkward transplant and old upon arrival. A decade had passed since Ford sunset the Ranger here (when it was still a compact truck), and this was the pickup that was supposed to resurrect the Ranger name in America? Well, here we are again: Ford has once again given the rest of the world a new Ranger before its home market, though it tightened up the timeline so that Americans are only waiting about two years for the new one.",
    "date": "10/05/2023"
  },
  {
    "title": "Tesla Cybertruck Might Need This Rack to Carry the Weight of Expectations—or Shovels",
    "imgUrl": "https://www.motortrend.com/uploads/2023/05/tesla-cybertruck-tool-rack-lithium-ground-breaking-7.jpg?fit=around%7C875:492",
    "url": "https://www.motortrend.com/news/tesla-cybertruck-bed-rack-prototype/",
    "description": "Tesla broke ground on its 12,000-acre in-house lithium refinery outside of Corpus Christi, Texas, this week. Why should you care? The facility, the first to utilize an acid-free lithium refining route that'll create sand and limestone byproducts rather than hazardous waste, will employ about 250 full-time employees and produce enough lithium for a million vehicles per year, according to Musk. But beyond all that, the event offered up our latest glimpse of the yet-unrealized Cybertruck pickup.",
    "date": "10/05/2023"
  },
  {
    "title": "2024 Porsche 718 Spyder RS Delivers GT4 Performance In a Topless Shape",
    "imgUrl": "https://www.motortrend.com/uploads/2023/05/Porsche_718_Spyder_RS-4.jpg?fit=around%7C875:492",
    "url": "https://www.motortrend.com/news/2024-porsche-718-spyder-rs-first-look-review/",
    "description": "The 2023 Porsche 718 Cayman GT4 RS is one of the most thrilling sport cars you can buy today. So, when the 2024 Porsche 718 Spyder RS adapted from the regular Boxster using GT4 RS bits was announced, we dropped what we were doing to check out this topless Boxster equivalent. As you'd expect, the 718 Spyder plucks the GT4 RS's powertrain and drops it into the Boxter body, delivering similarly thrilling performance only with an open top experience. If you think the GT4 RS sounds absurd (and its intake delivers too much volume), make sure you bring your earplugs when riding in the Spyder—with the top and windows down, nothing is between your eardrums and the flat-six engine's intakes, which sit atop each rear fender mere inches from each occupant's head.",
    "date": "09/05/2023"
  },
  {
    "title": "Luftgekuhlt 9: Reliving the World's Most Anticipated Air-Cooled Porsche Gathering",
    "imgUrl": "https://www.motortrend.com/uploads/2023/05/luftgekuhlt-nine-morning-roll-in.jpg?fit=around%7C875:492",
    "url": "https://www.motortrend.com/news/luftgekuhlt-9-air-cooled-porsche-event-gallery/",
    "description": "For the ninth time, Luftgekuhlt, the air-cooled Porsche car show started by Porsche racer Patrick Long and Howie Idelson, his business partner, maintained its perfect record of wowing show goers and setting a standard by which other organizers aren't likely to recreate easily. This time around it was Northern California serving as host to hundreds of P-cars and a rush of visitors treated to an assortment of colors, styles, and varying states of tune.",
    "date": "09/05/2023"
  },
  {
    "title": "Guess Which State Wants to Pave Its Roads With Radioactive Material",
    "imgUrl": "https://www.motortrend.com/uploads/2023/05/road-paver.png?fit=around%7C875:492",
    "url": "https://www.motortrend.com/news/florida-legislature-phosphogypsum-road-construction/",
    "description": "They say the road to a public health concern is paved with... a public health concern. That literally is happening in—where else?—Florida, where NPR reports state lawmakers have passed a bill (HB1191, which awaits governor Ron DeSantis's signature) instructing the Florida Transportation Department to study the use of phosphogypsum as an aggregate material in road construction. Can't pronounce phosphogypsum? That's okay, all you really need to know is that the material is radioactive.",
    "date": "09/05/2023"
  },
  {
    "title": "The 2024 Toyota Corolla Gets a Shady Special Edition",
    "imgUrl": "https://www.motortrend.com/uploads/2023/05/2024-Toyota-Corolla-Nightshade-6.png?fit=around%7C875:492",
    "url": "https://www.motortrend.com/news/2024-toyota-corolla-nightshade-edition-first-look-review/",
    "description": "The humble Toyota Corolla just received a design refresh last year, landing updates to its LED headlights as well as tweaks to the look of the front fascia and grille, with more minor changes around the body on most trims. Now that the base car has been updated, the special editions can have their turn. Enter the 2024 Toyota Corolla Nightshade edition, which darkens the look of the available Corolla sedan, hatchback, and now the hybrid model.",
    "date": "09/05/2023"
  },
  {
    "title": "New Three-Row Lexus TX SUV Will Squeeze In Up to 8 Passengers",
    "imgUrl": "https://www.motortrend.com/uploads/2022/04/2024-Lexus-TX-three-row-SUV-teaser.jpg?fit=around%7C875:492",
    "url": "https://www.motortrend.com/news/2024-lexus-tx-three-row-suv-preview-coming-soon/",
    "description": "You might think Lexus has an embarrassment of larger SUVs, and you'd be right—next to the midsize RX, the luxury crossover that essentially created the luxury crossover segment, Lexus introduced (for a brief time) the three-row RX L, the more off-road-oriented GX (a lineup mainstay), and the full-size LX (another mainstay). On the small end of the lineup, Lexus also sells the compact NX, the subcompact UX, and is adding the all-electric RZ 450e. SUVs aplenty, no? Yes, but there is a gap in the family, one sized like a Mercedes-Benz GLS-Class, BMW X7, or Audi Q7. An earlier report by Automotive News suggested as much, and now we know officially that Lexus is on top of it—the automaker released the teaser image above showing the new TX SUV's tail.",
    "date": "09/05/2023"
  },
  {
    "title": "Stock R32 Nissan Skyline GT-R for Sale: Prized Collectable or Ultimate Blank Canvas?",
    "imgUrl": "https://www.motortrend.com/uploads/2023/05/mecum-r32-skyline-rear-end.png?fit=around%7C875:492",
    "url": "https://www.motortrend.com/news/1994-r32-nissan-skyline-gtr-2023-mecum-indy-auction/",
    "description": "We're well beyond the dreaded 25-year rule that applies to some of Japan's most forbidden fruit which includes Nissan's highly sought after R32 GT-R. The truth is, if you've got internet access and enough stacks in your bank account then you can probably figure out how to import one of your own. In that search you're likely to find some solid examples as well as some less-than-stellar versions, but you'd be hard pressed to find one in entirely factory form and with incredibly low mileage, like this 1994 V-Spec II. And you won't need to import it.",
    "date": "08/05/2023"
  },
  {
    "title": "HOT ROD Power Tour 2023: Multi-Day Ticket Price Increases May 12!",
    "imgUrl": "https://www.motortrend.com/uploads/2023/05/002-hot-rod-power-tour-2023-car-show.jpg?fit=around%7C875:492",
    "url": "https://www.motortrend.com/events/hot-rod-power-tour-2023-ticket-price-increase/",
    "description": "By purchasing a Multi-Day credential—a great savings compared to buying single-day admission—you, a ride-along partner, and of course your car or truck become official participants in the 5-day, 1,300-mile journey (June 12 to June 16, 2023) that passes through and stops at various locations in Georgia, both Carolinas, and Tennessee.",
    "date": "08/05/2023"
  },
  {
    "title": "2024 Subaru Crosstrek 2.5L First Drive: Buy a Pressure Washer",
    "imgUrl": "https://www.motortrend.com/uploads/2023/05/2024-Subaru-Crosstrek-2.5L-First-Drive-44.png?fit=around%7C875:492",
    "url": "https://www.motortrend.com/reviews/2024-subaru-crosstrek-2-5-l-first-drive-review/",
    "description": "According to Subaru and Experian data, up to 97 percent of Subaru Crosstreks sold in the U.S. are still on the road today, representing that the brand's fastest-growing SUV model is reliable and worth keeping around. The Japanese automaker has moved over a million units in just two generations of Crosstrek, now with a new and improved third-gen introduced this year to keep things going. The new Crosstrek is available with either a 2.0L or 2.5L engine, the former of which we've already reviewed. Here's what we think of the more powerful, but just as efficient 2024 Subaru Crosstrek 2.5L (hint: it's the one you should get).",
    "date": "08/05/2023"
  },
  {
    "title": "Hyundai Might Build Radical N Vision 74 Coupe as New-Age Pony",
    "imgUrl": "https://www.motortrend.com/uploads/2022/08/Hyundai_N_Vision_74_Narrow-Body_1.jpg?fit=around%7C875:492",
    "url": "https://www.motortrend.com/news/hyundai-n-vision-74-concept-production-rumor/",
    "description": "We haven't been able to stop talking about the incredible Hyundai N Vision 74 concept vehicle since its debut last July, going so far as to present the case for Hyundai to push it into production. Well, we may now be getting our wish, as it's been reported Hyundai is planning to bring the N Vision 74 to reality as an all-new production model you may be able to buy soon.",
    "date": "08/05/2023"
  },
  {
    "title": "2024 GMC Hummer EV 3X Omega Edition Is One Spaced-Out Special",
    "imgUrl": "https://www.motortrend.com/uploads/2023/05/2024-GMC-Hummer-EV-3X-SUV-Omega-Edition-Neptune-Blue-Matte-1.jpg?fit=around%7C875:492",
    "url": "https://www.motortrend.com/news/2024-gmc-hummer-ev-3x-omega-edition/",
    "description": "General Motors is leaning into its interplanetary side again—not with a moon rover (this time), but with a new Omega Edition for the 2024 GMC Hummer EV SUV and Pickup models. Fortunately, the six-figure, limited-edition GMCs will get more than just a fancy Neptune Blue paint job and exterior badging when they land in the first half of 2024. Both the Omega Edition SUV and pickup are coming only in the Hummers' triple motor 3X configuration, equipped with the impressive Extreme Off-Road Package.",
    "date": "08/05/2023"
  },
  {
    "title": "Searching for Authentic OEM Honda and Acura Parts? Welcome to the DreamShop",
    "imgUrl": "https://www.motortrend.com/uploads/2023/05/2024-Acura-Integra-Type-S-19.jpg?fit=around%7C875:492",
    "url": "https://www.motortrend.com/news/honda-acura-dreamshop-oem-parts-accessories/",
    "description": "If you're anything like me, you do everything in your power to avoid having to bring your Honda or Acura to the dealer. Beyond the appointments, wait times, and general inconvenience, the labor fees are... wow. Of course, this is standard dealer service fare no matter what brand car you drive. Which is why if it's something I can fix or replace in my own garage, then I'm rolling up my sleeves and handling it myself.",
    "date": "04/05/2023"
  },
  {
    "title": "When Is the 2024 Toyota Tacoma Debuting? Here's the Long and Short (Bed) Of It",
    "imgUrl": "https://www.motortrend.com/uploads/2023/05/2024-Toyota-Tacoma-teasers-3.jpg?fit=around%7C875:492",
    "url": "https://www.motortrend.com/news/2024-toyota-tacoma-preview-teaser/",
    "description": "The next-generation Toyota Tacoma pickup is on the cusp of its debut, and that means it's teaser time. Toyota is rolling out a steady drip of preview images of the new midsize truck, and we've gathered them all here, in order of newest to oldest, for your perusal:",
    "date": "04/05/2023"
  }
]
